routes_controllers/app/controllers/artworks_controller.rb

  def create
    @artwork = Artwork.new(strong_params)
    if @artwork.save
---
INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "\"Blue Boy\""], ["image_url", "\".com\""], ["artist_id", 2], ["created_at", "2019-07-01 21:00:18.286528"], ["updated_at", "2019-07-01 21:00:18.286528"]]