routes_controllers/app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])
    if @user.update(strong_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "\"coreyw34@gmail.com\""], ["updated_at", "2019-07-01 19:23:23.885836"], ["id", 1]]

  def create
    @user = User.new(strong_params)
    if @user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "\"bobbyjones45\""], ["created_at", "2019-07-01 20:41:04.178339"], ["updated_at", "2019-07-01 20:41:04.178339"]]